JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_irtc.h
    return intsEnabled;
}

/*! @}*/

/*!
 * @name Status Interface
 * @{
 */

/*!
 * @brief Gets the IRTC status flags
 *
 * @param base IRTC peripheral base address
 *
 * @return The status flags. This is the logical OR of members of the
 *         enumeration ::irtc_status_flags_t
 */
static inline uint32_t IRTC_GetStatusFlags(RTC_Type *base)
{
#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
    return (base->ISR | ((uint32_t)base->STATUS << 16U) | ((uint32_t)base->WAKE_TIMER_CTRL << 28U));
#else
    return (base->ISR | ((uint32_t)base->STATUS << 16U));
#endif
}

/*!
 * @brief Clears the IRTC status flags.
 *
 * @param base IRTC peripheral base address
 * @param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::irtc_status_flags_t
 */
static inline void IRTC_ClearStatusFlags(RTC_Type *base, uint32_t mask)
{
    base->ISR    = (uint16_t)mask;
    base->STATUS = (base->STATUS & ~IRTC_STATUS_W1C_BITS) |
                   ((uint16_t)(mask >> 16U));
#if !defined(FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE) || (!FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE)
    /* TAMPER flag need clear TAMPER_SCR[TMPR_STS] filed */
    if (0U != (mask & (uint32_t)kIRTC_TamperFlag))
    {
        base->TAMPER_SCR |= RTC_TAMPER_SCR_TMPR_STS_MASK;
    }
#endif
#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
    if (0U != (mask & (uint32_t)kIRTC_WakeTimerFlag))
    {
        base->WAKE_TIMER_CTRL |= RTC_WAKE_TIMER_CTRL_WAKE_FLAG_MASK;
    }
#endif
}

/*! @}*/

#if !defined(FSL_FEATURE_RTC_HAS_NO_GP_DATA_REG) || (!FSL_FEATURE_RTC_HAS_NO_GP_DATA_REG)

/*!
 * @brief This function sets the specified capacitor configuration for the RTC oscillator.
 *
 * @param base    IRTC peripheral base address
 * @param capLoad Oscillator loads to enable. This is a logical OR of members of the
 *                enumeration ::irtc_osc_cap_load_t
 */
static inline void IRTC_SetOscCapLoad(RTC_Type *base, uint16_t capLoad)
{
    uint16_t reg = base->GP_DATA_REG;

    reg &= ~((uint16_t)kIRTC_Capacitor2p | (uint16_t)kIRTC_Capacitor4p | (uint16_t)kIRTC_Capacitor8p |
             (uint16_t)kIRTC_Capacitor16p);
    reg |= capLoad;

    base->GP_DATA_REG = reg;
}

#endif

/*!
 * @brief Locks or unlocks IRTC registers for write access.
 *
 * @note When the registers are unlocked, they remain in unlocked state for
 * 2 seconds, after which they are locked automatically. After
 * power-on-reset, the registers come out unlocked and they are locked
 * automatically 15 seconds after power on.
 *
 * @param base IRTC peripheral base address
 * @param lock true: Lock IRTC registers; false: Unlock IRTC registers.
 *
 * @return kStatus_Success: if lock or unlock operation is successful
 *         kStatus_Fail: if lock or unlock operation fails even after multiple retry attempts
 */
status_t IRTC_SetWriteProtection(RTC_Type *base, bool lock);

/*!
 * @brief Performs a software reset on the IRTC module.
 *
 * Clears contents of alarm, interrupt (status and enable except tamper interrupt enable bit)
 * registers, STATUS[CMP_DONE] and STATUS[BUS_ERR]. This has no effect on DST, calendaring, standby time
 * and tamper detect registers.
 *
 * @param base IRTC peripheral base address
 */
static inline void IRTC_Reset(RTC_Type *base)
{
    base->CTRL |= RTC_CTRL_SWR_MASK;
}

#if !defined(FSL_FEATURE_RTC_HAS_NO_GP_DATA_REG) || (!FSL_FEATURE_RTC_HAS_NO_GP_DATA_REG)

/*!
 * @brief Enable/disable 32 kHz RTC OSC clock during RTC register write
 *
 * @param base IRTC peripheral base address
 * @param enable Enable/disable 32 kHz RTC OSC clock.
 *               - true: Enables the oscillator.
 *               - false: Disables the oscillator.
 *
 */
static inline void IRTC_Enable32kClkDuringRegisterWrite(RTC_Type *base, bool enable)
{
    uint16_t mask = RTC_GP_DATA_REG_CFG0_MASK;
    if (enable)
    {
        base->GP_DATA_REG &= ~mask;
    }
    else
    {
        base->GP_DATA_REG |= mask;
    }
}

#endif

/*!
 * @brief Select which clock to output from RTC.
 *
 * Select which clock to output from RTC for other modules to use inside SoC, for example,
 * RTC subsystem needs RTC to output 1HZ clock for sub-second counter.
 *
 * @param base IRTC peripheral base address
 * @param cloOut select clock to use for output,
 */
void IRTC_ConfigClockOut(RTC_Type *base, irtc_clockout_sel_t clkOut);

#if defined(FSL_FEATURE_RTC_HAS_CLOCK_SELECT) && FSL_FEATURE_RTC_HAS_CLOCK_SELECT

/*!
 * @brief Select which clock is used by RTC.
 *
 * Select which clock is used by RTC to output to the peripheral
 * and divided to generate a 512 Hz clock and a 1 Hz clock.
 *
 * @param base IRTC peripheral base address
 * @param clkSelect select clock used by RTC
 */
void IRTC_ConfigClockSelect(RTC_Type *base, irtc_clock_select_t clkSelect);

#endif /* FSL_FEATURE_RTC_HAS_CLOCK_SELECT */

#if defined(FSL_FEATURE_RTC_HAS_CLOCK_OUTPUT_DISABLE) && FSL_FEATURE_RTC_HAS_CLOCK_OUTPUT_DISABLE

/*!
 * @brief Determines whether the selected clock is output to other peripherals.
 *
 * Determines whether the selected clock is output to other peripherals.
 *
 * @param base IRTC peripheral base address
 * @param enable determine whether the selected clock is output to other peripherals
 */
static inline void IRTC_EnableClockOutputToPeripheral(RTC_Type *base, bool enable)
{
    if (enable)
    {
        base->CTRL &= ~(uint16_t)RTC_CTRL_CLKO_DIS_MASK;
    }
    else
    {
        base->CTRL |= RTC_CTRL_CLKO_DIS_MASK;
    }
}

#endif /* FSL_FEATURE_RTC_HAS_CLOCK_OUTPUT_DISABLE */

#if !defined(FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE) || (!FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE)

/*!
 * @brief Gets the IRTC Tamper status flags
 *
 * @param base IRTC peripheral base address
 *
 * @return The Tamper status value.
 */
static inline uint8_t IRTC_GetTamperStatusFlag(RTC_Type *base)
{
    return (uint8_t)((base->TAMPER_SCR & RTC_TAMPER_SCR_TMPR_STS_MASK) >> RTC_TAMPER_SCR_TMPR_STS_SHIFT);
}

/*!
 * @brief Gets the IRTC Tamper status flags
 *
 * @param base IRTC peripheral base address
 *
 */
static inline void IRTC_ClearTamperStatusFlag(RTC_Type *base)
{
    /* Writing '1' to this field clears the tamper status.*/
    base->TAMPER_SCR |= RTC_TAMPER_SCR_TMPR_STS_MASK;
}

/*!
 * @brief Set tamper configuration over
 *
 * Note that this API is neeeded after call IRTC_SetTamperParams to configure tamper events to
 * notify IRTC module that tamper configuration process is over.
 *
 * @param base IRTC peripheral base address
 *
 */
static inline void IRTC_SetTamperConfigurationOver(RTC_Type *base)
{
    /* Set tamper configuration over.*/
    base->CTRL2 |= RTC_CTRL2_TAMP_CFG_OVER_MASK;
}

#endif

/*!
 * @name Daylight Savings Interface
 * @{
 */

