JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_irtc.h
#if !(defined(FSL_FEATURE_RTC_IS_SLAVE) && (FSL_FEATURE_RTC_IS_SLAVE != 0U))
/*!
 * @brief Sets the IRTC daylight savings start and stop date and time.
 *
 * It also enables the daylight saving bit in the IRTC control register
 *
 * @param base     IRTC peripheral base address
 * @param datetime Pointer to a structure where the date and time details are stored.
 */
void IRTC_SetDaylightTime(RTC_Type *base, const irtc_daylight_time_t *datetime);
#endif /* FSL_FEATURE_RTC_IS_SLAVE  */

/*!
 * @brief Gets the IRTC daylight savings time and stores it in the given time structure.
 *
 * @param base     IRTC peripheral base address
 * @param datetime Pointer to a structure where the date and time details are stored.
 */
void IRTC_GetDaylightTime(RTC_Type *base, irtc_daylight_time_t *datetime);

/*! @}*/

#if !(defined(FSL_FEATURE_RTC_IS_SLAVE) && (FSL_FEATURE_RTC_IS_SLAVE != 0U))
/*!
 * @name Time Compensation Interface
 * @{
 */

/*!
 * @brief Enables the coarse compensation and sets the value in the IRTC compensation register.
 *
 * @param base                 IRTC peripheral base address
 * @param compensationValue    Compensation value is a 2's complement value.
 * @param compensationInterval Compensation interval.
 */
void IRTC_SetCoarseCompensation(RTC_Type *base, uint8_t compensationValue, uint8_t compensationInterval);

/*!
 * @brief Enables the fine compensation and sets the value in the IRTC compensation register.
 *
 * @param base                 The IRTC peripheral base address
 * @param integralValue        Compensation integral value; twos complement value of the integer part
 * @param fractionValue        Compensation fraction value expressed as number of clock cycles of a
 *                             fixed 4.194304Mhz clock that have to be added.
 * @param accumulateFractional Flag indicating if we want to add to previous fractional part;
 *                             true: Add to previously accumulated fractional part,
 *                             false: Start afresh and overwrite current value
 */
void IRTC_SetFineCompensation(RTC_Type *base, uint8_t integralValue, uint8_t fractionValue, bool accumulateFractional);

/*! @}*/
#endif /* FSL_FEATURE_RTC_IS_SLAVE  */

#if !defined(FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE) || (!FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE)

/*!
 * @name Tamper Interface
 * @{
 */

/*!
 * @brief This function allows configuring the four tamper inputs.
 *
 * The function configures the filter properties for the three external tampers.
 * It also sets up active/passive and direction of the tamper bits, which are not available
 * on all platforms.
 * @note This function programs the tamper filter parameters. The user must gate the 32K clock to
 * the RTC before calling this function. It is assumed that the time and date are set after this
 * and the tamper parameters do not require to be changed again later.
 *
 * @param base         The IRTC peripheral base address
 * @param tamperNumber The IRTC tamper input to configure
 * @param tamperConfig The IRTC tamper properties
 */
void IRTC_SetTamperParams(RTC_Type *base, irtc_tamper_pins_t tamperNumber, const irtc_tamper_config_t *tamperConfig);

#if defined(FSL_FEATURE_RTC_HAS_TAMPER_QUEUE) && (FSL_FEATURE_RTC_HAS_TAMPER_QUEUE)

/*!
 * @brief This function reads the tamper timestamp and returns the associated tamper pin.
 *
 * The tamper timestamp has month, day, hour, minutes, and seconds. Ignore the year field as this
 * information is not available in the tamper queue. The user should look at the RTC_YEARMON register
 * for this because the expectation is that the queue is read at least once a year.
 * Return the tamper pin number associated with the timestamp.
 *
 * @param base             The IRTC peripheral base address
 * @param tamperTimestamp  The tamper timestamp
 *
 * @return The tamper pin number
 */
uint8_t IRTC_ReadTamperQueue(RTC_Type *base, irtc_datetime_t *tamperTimestamp);

/*!
 * @brief Gets the IRTC Tamper queue full status
 *
 * @param base IRTC peripheral base address
 *
 * @retval true Tamper queue is full.
 * @retval false Tamper queue is not full.
 */
static inline bool IRTC_GetTamperQueueFullStatus(RTC_Type *base)
{
    return ((0U != (base->TAMPER_SCR & RTC_TAMPER_QSCR_Q_FULL_MASK)) ? true : false);
}

/*!
 * @brief Clear the IRTC Tamper queue full status
 *
 * @param base IRTC peripheral base address
 *
 */
static inline void IRTC_ClearTamperQueueFullStatus(RTC_Type *base)
{
    base->TAMPER_QSCR |= RTC_TAMPER_QSCR_Q_CLEAR_MASK;
}
#endif /* FSL_FEATURE_RTC_HAS_TAMPER_QUEUE */

/*! @}*/

#endif

#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
/*!
 * @name RTC subsystem Interface
 * @{
 */

#if !(defined(FSL_FEATURE_RTC_HAS_SUBSECOND) && (FSL_FEATURE_RTC_HAS_SUBSECOND == 0))
/*!
 * @brief Enable the RTC wake-up timer.
 *
 * 1HZ clock out selected via call to API IRTC_ConfigClockOut in order for the subsecond
 * counter to synchronize with the RTC_SECONDS counter.
 *
 * @param base   RTC peripheral base address
 * @param enable Use/Un-use the sub-second counter.
 *               - true: Use RTC wake-up timer at the same time.
 *               - false: Un-use RTC wake-up timer, RTC only use the normal seconds timer by default.
 */
static inline void IRTC_EnableSubsecondCounter(RTC_Type *base, bool enable)
{
    if (enable)
    {
        base->SUBSECOND_CTRL |= RTC_SUBSECOND_CTRL_SUB_SECOND_CNT_EN_MASK;
    }
    else
    {
        base->SUBSECOND_CTRL &= ~RTC_SUBSECOND_CTRL_SUB_SECOND_CNT_EN_MASK;
    }
}

/*!
 * @brief Read the actual RTC sub-second COUNT value.
 *
 * @param base  RTC peripheral base address
 *
 * @return The actual RTC sub-second COUNT value.
 */
static inline uint32_t IRTC_GetSubsecondCount(RTC_Type *base)
{
    uint32_t a, b;

    /* Follow the RF document to read the RTC default seconds timer (1HZ) counter value. */
    do
    {
        a = base->SUBSECOND_CNT;
        b = base->SUBSECOND_CNT;
    } while (a != b);

    return b;
}
#endif /* FSL_FEATURE_RTC_HAS_SUBSECOND */

/*!
 * @brief Set countdown value to the RTC wake timer counter register.
 *
 * @param base        RTC peripheral base address
 * @param enable1kHzClk   Enable 1kHz clock source for the wake timer, else use the 32kHz clock.
 * @param wakeupValue The value to be loaded into the WAKE register in wake timer counter.
 */
static inline void IRTC_SetWakeupCount(RTC_Type *base, bool enable1kHzClk, uint32_t wakeupValue)
{
    /* Config whether enable the wakeup counter */
    uint32_t writeVal;
    writeVal              = base->WAKE_TIMER_CTRL;
    base->WAKE_TIMER_CTRL = RTC_WAKE_TIMER_CTRL_CLR_WAKE_TIMER_MASK;

    if (enable1kHzClk)
    {
        writeVal |= RTC_WAKE_TIMER_CTRL_OSC_DIV_ENA_MASK;
    }
    else
    {
        writeVal &= ~RTC_WAKE_TIMER_CTRL_OSC_DIV_ENA_MASK;
    }

    base->WAKE_TIMER_CTRL = writeVal;
    /* Set the start countdown value into the RTC WAKE register */
    base->WAKE_TIMER_CNT = wakeupValue;
}

/*!
 * @brief Read the actual value from the WAKE register value in RTC wake timer.
 *
 * @param base        RTC peripheral base address
 *
 * @return The actual value of the WAKE register value in wake timer counter.
 */
static inline uint32_t IRTC_GetWakeupCount(RTC_Type *base)
{
    /* Read current wake-up countdown value */
    return base->WAKE_TIMER_CNT;
}

/*! @}*/
#endif

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* FSL_IRTC_H_ */
